doc/BUILD/source/_static/soap_outputs/6.2.314.3321/create_saved_question_from_json_step_7_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <saved_question>
          <mod_time>2015-08-07T11:47:44</mod_time>
          <expire_seconds>600</expire_seconds>
          <row_count_flag>1</row_count_flag>
          <name>Run Unmanaged Asset Scan on All Machines API TEST</name>
          <public_flag>1</public_flag>
          <archive_enabled_flag>0</archive_enabled_flag>
          <sort_column>0</sort_column>
          <action_tracking_flag>0</action_tracking_flag>
          <hidden_flag>0</hidden_flag>
          <issue_seconds>120</issue_seconds>
          <keep_seconds>3600</keep_seconds>
          <issue_seconds_never_flag>0</issue_seconds_never_flag>
          <query_text>Get Is Windows from all machines</query_text>
          <most_recent_question_id>6074</most_recent_question_id>
          <mod_user>
            <name>Jim Olsen</name>
          </mod_user>
          <question>
            <hidden_flag>0</hidden_flag>
            <skip_lock_flag>0</skip_lock_flag>
            <query_text>Get Is Windows from all machines</query_text>
            <id>6074</id>
            <expire_seconds>0</expire_seconds>
            <force_computer_id_flag>0</force_computer_id_flag>
            <action_tracking_flag>0</action_tracking_flag>
            <expiration>2015-09-05T04:00:03</expiration>
            <user>
              <name>Jim Olsen</name>
              <id>1</id>
            </user>
            <management_rights_group>
              <id>0</id>
            </management_rights_group>
            <selects>
              <select>
                <filter>
                  <substring_length>0</substring_length>
                  <end_time>2001-01-01T00:00:00</end_time>
                  <not_flag>0</not_flag>
                  <all_times_flag>0</all_times_flag>
                  <start_time>2001-01-01T00:00:00</start_time>
                  <ignore_case_flag>1</ignore_case_flag>
                  <max_age_seconds>0</max_age_seconds>
                  <value_type>String</value_type>
                  <delimiter_index>0</delimiter_index>
                  <utf8_flag>0</utf8_flag>
                  <operator>Less</operator>
                  <all_values_flag>0</all_values_flag>
                  <substring_flag>0</substring_flag>
                  <substring_start>0</substring_start>
                </filter>
                <sensor>
                  <category>Operating System</category>
                  <hash>2721439124</hash>
                  <name>Is Windows</name>
                  <hidden_flag>0</hidden_flag>
                  <delimiter>,</delimiter>
                  <creation_time>2015-08-07T11:45:36</creation_time>
                  <exclude_from_parse_flag>0</exclude_from_parse_flag>
                  <last_modified_by>Jim Olsen</last_modified_by>
                  <string_count>3</string_count>
                  <modification_time>2015-08-07T11:45:36</modification_time>
                  <ignore_case_flag>1</ignore_case_flag>
                  <max_age_seconds>86400</max_age_seconds>
                  <value_type>String</value_type>
                  <source_id>0</source_id>
                  <id>35</id>
                  <description>Returns whether the machine runs Windows.  True if so, False if not.
Example: True</description>
                  <metadata>
                    <item>
                      <admin_flag>0</admin_flag>
                      <name>defined</name>
                      <value>Tanium</value>
                    </item>
                  </metadata>
                  <queries>
                    <query>
                      <platform>Windows</platform>
                      <script_type>VBScript</script_type>
                      <script>&amp;#039;========================================
&amp;#039; Is Windows
&amp;#039;========================================

Wscript.echo &amp;quot;True&amp;quot;</script>
                    </query>
                    <query>
                      <platform>Linux</platform>
                      <script_type>UnixShell</script_type>
                      <script>#!/bin/bash
echo False</script>
                    </query>
                    <query>
                      <platform>Mac</platform>
                      <script_type>UnixShell</script_type>
                      <script>#!/bin/bash
echo False</script>
                    </query>
                  </queries>
                </sensor>
              </select>
            </selects>
            <saved_question>
              <id>1</id>
            </saved_question>
          </question>
          <archive_owner>
            <name>Jim Olsen</name>
            <id>1</id>
          </archive_owner>
          <user>
            <name>Jim Olsen</name>
            <id>1</id>
          </user>
          <packages></packages>
        </saved_question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>